In [3]:
import pandas as pd
import numpy as np


titan_df = pd.read_csv('../scv_files/titanic/train.csv')

In [4]:
titan_df.groupby('Sex').mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [5]:
# 성별, 좌석등급 별 통계
titan_df.groupby(['Sex', 'Pclass']).mean()

               PassengerId  Survived        Age     SibSp     Parch  \
Sex    Pclass
female 1        469.212766  0.968085  34.611765  0.553191  0.457447
       2        443.105263  0.921053  28.722973  0.486842  0.605263
       3        399.729167  0.500000  21.750000  0.895833  0.798611
male   1        455.729508  0.368852  41.281386  0.311475  0.278689
       2        447.962963  0.157407  30.740707  0.342593  0.222222
       3        455.515850  0.135447  26.507589  0.498559  0.224784

                     Fare
Sex    Pclass
female 1       106.125798
       2        21.970121
       3        16.118810
male   1        67.226127
       2        19.741782
       3        12.661633

In [6]:
# 성별, 좌석등급 별 통계
titan_df.groupby(['Sex', 'Pclass'])['Survived'].mean()

Sex     Pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: Survived, dtype: float64

In [7]:
# 성별, 좌석등급 별 통계
titan_df.groupby(['Sex', 'Pclass'])[['Survived']].mean()

               Survived
Sex    Pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

In [8]:
titan_df.groupby(['Sex', 'Pclass'])[['Survived']].mean().reset_index()

      Sex  Pclass  Survived
0  female       1  0.968085
1  female       2  0.921053
2  female       3  0.500000
3    male       1  0.368852
4    male       2  0.157407
5    male       3  0.135447

In [9]:
titan_df.groupby(['Sex', 'Pclass'])[['Survived', 'Age']].mean()

               Survived        Age
Sex    Pclass
female 1       0.968085  34.611765
       2       0.921053  28.722973
       3       0.500000  21.750000
male   1       0.368852  41.281386
       2       0.157407  30.740707
       3       0.135447  26.507589

## 01) 데이터프레임에 대하여 apply()를 활용하여 class 컬럼의 값을 다음과 같이 바꾸고, 분포를 출력 후 변경 전과 동일한지 확인하세요
삼등석    491

일등석    216

이등석    184

Name: class, dtype: int64

In [10]:
titan_df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [12]:
def trans_to_pclass(pclass):
    if pclass == 3:
        return '삼등석'
    elif pclass == 2:
        return '이등석'
    else:
        return '일등석'

In [14]:
titan_df['Pclass'].apply(trans_to_pclass).value_counts()

삼등석    491
일등석    216
이등석    184
Name: Pclass, dtype: int64

# `groupby()`를 활용하여 다음을 출력하세요. 
## 01) pclass 별 생존율

In [24]:
titan_df.groupby('Pclass')[['Survived']].mean()

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

## 02) embarked 별 생존율 통합 통계

In [27]:
titan_df.groupby('Embarked')['Survived'].agg(['mean', 'var'])

              mean       var
Embarked
C         0.553571  0.248610
Q         0.389610  0.240943
S         0.336957  0.223764

## 03) who, pclass 별 생존율, 생존자수

In [30]:
titan_df.groupby(['Sex', 'Pclass'])['Survived'].agg(['mean', 'sum'])

                   mean  sum
Sex    Pclass
female 1       0.968085   91
       2       0.921053   70
       3       0.500000   72
male   1       0.368852   45
       2       0.157407   17
       3       0.135447   47